//IntDemo类型
/*
	当表示的数据超出数据类型的表示范围时，会发生数据溢出
	int的范围是（-2147483648---- 8 +
*/
public class IntDemo 
{
	public static void main(String[] args) 
	{
		int max = 2147483647;
		max = max + 1;//等于：-2147483648
		System.out.println(max);
		/*
			原理：
			   二进制：0b01111111_11111111_11111111_11111111
			+  二进制：0b00000000_00000000_00000000_00000001
			   -----------------------------------------------------
			   结果是：0b10000000_00000000_00000000_00000000                                    0
		
		*/
		int min = -2147483648;
		min = min - 1;//等于：2147483647
		System.out.println(min);//等于：2147483647

	}
}
